Merge pull request #2 from compscibro/main
updated diagram
